#자료구조 한옥영 교수님 13주차
#Hashing 과제
#최종 작성일: 2020.06.09 (화)
#2019312481 심규현

MAX = 137
array = [None] * MAX
cnt = 0

def doubleHash(idx, key):
    global cnt
    cnt = cnt+1
    C = 107
    step = C - (key % C)
    return (idx + step) % MAX
    

def divHash(key):
    global MAX
    global array
    idx = key % MAX
    while(array[idx] != None): #이미 값 존재하는 동안 = 충돌이라면
        idx = doubleHash(idx, key)
    array[idx] = key
    return

input_array = [512, 1, 513, 515, 4, 6, 7, 522, 524, 13, 525, 527, 535, 536, 541,
               557, 560, 50, 56, 571, 574, 577, 580, 68, 583, 72, 77, 79, 81,
               601, 89, 613, 614, 616, 110, 113, 628, 116, 121, 130, 135, 654,
               658, 163, 677, 681, 173, 686, 692, 182, 705, 194, 716, 205, 722,
               727, 217, 730, 734, 226, 742, 743, 753, 755, 757, 245, 252, 265,
               778, 268, 274, 275, 795, 798, 301, 817, 818, 307, 829, 831, 833,
               321, 324, 332, 845, 339, 342, 854, 858, 348, 353, 354, 360, 361,
               362, 876, 365, 881, 376, 888, 894, 895, 896, 897, 387, 389, 390,
               395, 398, 911, 913, 407, 920, 921, 412, 925, 418, 932, 936, 937,
               940, 434, 439, 442, 956, 446, 958, 449, 968, 970, 461, 463, 977,
               992, 491, 496, 503]

#print(len(input_array)) = 137개

#print(input_array)
for i in range(MAX):
    divHash(input_array[i])

for i in range(MAX):
    print("[%d]: %d"%(i, array[i]))
